far-side.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<title>Far Side</title>
<!-- 2016-06-08 Ср 13:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Роман Зайруллин" />
</head>
<body>
<div id="content">
<h1 class="title">Far Side</h1>
<div id="table-of-contents">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. CRPG. Введение</a>
<ul>
<li><a href="#sec-1-1">1.1. Дисплей и настройки</a></li>
<li><a href="#sec-1-2">1.2. <span class="todo TODO">TODO</span> Дисплей</a></li>
<li><a href="#sec-1-3">1.3. Инструменты и начальный набор функций.</a></li>
<li><a href="#sec-1-4">1.4. Внутренний язык игры.</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Ролевая система</a>
<ul>
<li><a href="#sec-2-1">2.1. Характеристики</a></li>
<li><a href="#sec-2-2">2.2. Перки</a></li>
<li><a href="#sec-2-3">2.3. <span class="todo TODO">TODO</span> Разработать (утащить) формулы для учета экспы и уровней.</a></li>
<li><a href="#sec-2-4">2.4. Создание персонажа</a></li>
<li><a href="#sec-2-5">2.5. Аффекты</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Сценарии</a></li>
<li><a href="#sec-4">4. Таблицы</a>
<ul>
<li><a href="#sec-4-1">4.1. НПС</a></li>
<li><a href="#sec-4-2">4.2. Бестиарий</a></li>
<li><a href="#sec-4-3">4.3. Предметы</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. Оружие</a></li>
<li><a href="#sec-4-3-2">4.3.2. Одежда</a></li>
<li><a href="#sec-4-3-3">4.3.3. Инструменты</a></li>
<li><a href="#sec-4-3-4">4.3.4. Расходуемые</a></li>
<li><a href="#sec-4-3-5">4.3.5. Хлам</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Локации</a></li>
<li><a href="#sec-6">6. Звук</a>
<ul>
<li><a href="#sec-6-1">6.1. libpd и прочее</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CRPG. Введение</h2>
<div class="outline-text-2" id="text-1">
<p>
Этот документ содержит все. И предусматривает все.
Вдохновленный Shadowrun, Fallout, ADOM и различными TDS, я хочу поместить
вас в мир, в котором нет магии, зато есть пар и электричество. И,
может быть, немного клюквы. Ну и нефть еще. И вообще много всяких
интересных штук.
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Дисплей и настройки</h3>
<div class="outline-text-3" id="text-1-1">
<p>
По умолчанию дисплей имеет разрешение 640х480, это значение
захардкожено, как способное сработать наверняка.
</p>
<div class="org-src-container">

<pre class="src src-python">import pygame
from pygame.locals import *
from OpenGL.GL import *
from OpenGL.GLU import *

import surface

class Display:
    def __init__(self):
	pygame.init()
	pygame.display.set_caption("Far Prototype")
	self.set_display((640, 480))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Дисплей</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Добавить чтение конфигов
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Инструменты и начальный набор функций.</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Для игры используются стандартные d10, d4, d6, d12, d20 дайсы.
</p>
<div class="org-src-container">

<pre class="src src-python"># -*- coding: utf-8 -*-
import random

def d10():
 random.seed(100)
 return random.randint(1, 10)

def d4():
 random.seed(100)
 return random.randint(1, 4)

def d6():
 random.seed(100)
 return random.randint(1, 6)

def d12():
 random.seed(100)
 return random.randint(1, 12)

def d20():
 random.seed(100)
 return random.randint(1, 20)
</pre>
</div>
<p>
Все настройки хранятся в файле "game.conf", а сами объекты должны
создаваться из файлов с описаниями этих самых объектов. Это позволит
без больших проблем расширять игру, наполнять ее контентом, и, при
необходимости, перенести на какой-нибудь другой
язык\платформу. Достаточно будет просто переписать транслятор. 
Дуаю, лучше использовать csv и юниксовый конфиг-формат. Они уже
написаны. Хотя, все равно придется что-то выдумать.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Внутренний язык игры.</h3>
<div class="outline-text-3" id="text-1-4">
<p>
  Конечно же csv для табличных данных, конфиг формат для конфигов
(ибо из коробки все поддерживется, стандартная библиотека
ванлав). Да и логику синей изолентой. Нечего выдумывать. Все что
нужно &#x2013; имеется. Ура, товарищи. 
</p>
</div>
</div>
</div>




<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Ролевая система</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Характеристики</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Проблема выбора ролевой системы в наличии магии у большинства
РПГ. Я, конечно, поклонник фентези, но в своем проекте использовать
ее не хочу. На самом деле, это ж уже достаточно приевшаяся тема и
кто только не делает РПГ с магией и красотками. Я же хочу окунуться
в мир альтернативной истории в компании с Говардом Радостью-моим
Лавкрафтом.
Итак. Характеристики. (d10 при создании, с
возможностью корректировки)
</p>
<ul class="org-ul">
<li>Сила    
</li>
<li>Ловкость  
</li>
<li>Интеллект
</li>
<li>Восприятие
</li>
<li>Здоровье<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</li>
<li>Харизма<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</li>
<li>Удача
</li>
<li>Воля
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Перки</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Так же, каждый персонаж должен иметь инвентарь (чтоб безумным манчам
было откуда собирать лут).
Помимо основных характеристик, персонажи так же имеют различные навыки
различные навыки:
</p>
<ul class="org-ul">
<li>Оружие, боевые навыки
<ul class="org-ul">
<li>Холодное
</li>
<li>Огнестрельное
</li>
<li>Рукопашный бой
</li>
</ul>
</li>
<li>Техника
<ul class="org-ul">
<li>Взлом
</li>
<li>Ремонт
</li>
</ul>
</li>
<li>Исследования
</li>
<li>Люди
<ul class="org-ul">
<li>Кража
</li>
<li>Ложь
</li>
<li>Убеждение
</li>
<li>Хитрость
</li>
</ul>
</li>
<li>Медицина
<ul class="org-ul">
<li>Хирургия
</li>
<li>Первая помощь
</li>
</ul>
</li>
</ul>
<p>
Так же, естественно, каждый персонаж имеет имя, пол, вид (человек,
собака, дерево), уровень (номинальное количество ХР) и описание. 
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Разработать (утащить) формулы для учета экспы и уровней.</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-python"># -*- coding: utf-8 -*-

class Сharacter:
 def __init__(self, characterName):
   self.characterName = ""
   self.description = ""

   self.strength = 0
   self.agila = 0
   self.intellegense = 0
   self.perception = 0
   self.body = 0
   self.charisma = 0
   self.luck = 0
   self.will = 0

   self.perks = { 'meele-weapon': 0, 'guns': 0, 'meele': 0, 
	   'breaking': 0, 'repair': 0, 'investigation': 0, 
	   'research': 0, 
	   'stealing': 0, 'lie': 0, 'conviction':0, 'tricks':0,
	   'surgeons': 0, 'first-aid': 0}
   self.xp = 0
   self.lvl = 1
   self.description = ""
   self.sort = ""
   self.inventory = []
   self.log = ""

 def lvlup(self, xp, lvl):

 def death(self):
     itemsDrop(self.inventory)
     self.description+=log
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Создание персонажа</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Персонаж создается броском d10
</p>
<div class="org-src-container">

<pre class="src src-python"># -*- coding: utf-8 -*-
from game-classes import *
from functions import *

name = 'None'
def createHero():

  return playerStat


player = Сharacter(name, playerStat, playerPerks)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Аффекты</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Сценарии</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python">#!/usr/bin/python
# -*- coding: utf-8 -*-

import pygame as pg
from game-classes import *
from functions import *
from player import *
from datetime import datetime
import numpy as np
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Таблицы</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> НПС</h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Бестиарий</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Предметы</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Оружие</h4>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Одежда</h4>
</div>
<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> Инструменты</h4>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> Расходуемые</h4>
</div>
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> Хлам</h4>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Локации</h2>
<div class="outline-text-2" id="text-5">
<p>
Важной частью повествования является карта. Для более эффективного
построения локаций разобьем карту на участки, от которых и будем
отталкиваться. Пример: имеется некоторый участок под названием
"город". Тип участка задает колличество домов, площадь, и плотность
построения этих самых домов. Которая будет немного варьироваться от
города к городу. Если это город. То как минимум он будет иметь:
</p>
<ul class="org-ul">
<li>Церковь
</li>
<li>Большую школу
</li>
<li>Общепит
</li>
<li>Суд
</li>
<li>Полицейский участок
</li>
<li>Больницу
</li>
</ul>
<p>
Большой город имеет на границе помимо вышеперечисленного:
</p>
<ul class="org-ul">
<li>Тюрьму на границе города
</li>
<li>Колледж\Университет
</li>
<li>Промышленное строение. (Завод, фабрика, иже)
</li>
</ul>
<p>
Я не вижу смысла делать больше трех крупных городов. Каждый из которых
будет своеобразным центром.
От крупных поселений более мелкие располагаются радиально, в
соотвествии с местностью и более мелкие зависят от ближайшего по
величине. Т.е. Карта опирается на укроподобный граф. Вот
так. Опирается, но не следует ему бесприкословно.
Так как мастер каждую новую игру начинает с нуля, соответственно,
названия местностей меняются каждое прохождение, хотя, вероятность
совпрадения, определенно, присутствует.
</p>
<div class="org-src-container">

<pre class="src src-python">import random

typeMap = ['big_sity', 'medium_city', 'small_city', 'village']
labelsFile = open('labels.fst', 'r')
labelsTowns = labelsFile.read()
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Звук</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> libpd и прочее</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Конечно, процедурный синтез, во многом, это все затевается ради
него. Помимо, конечно, изменяющегося, в зависимости от
происходящего, саундтрека. Мне хочется полностью обойтись без
предзаписанного звука. Это позволит использовать разнообразное
окружение, гибкое и интересное. И при этом игра не будет много
весить.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#1057;&#1085;&#1086;&#1089;&#1082;&#1080;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Аналогично характеристике "Телосложение" в ДНД-лайк системахз
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Если, конечно, я не придумаю чего иного
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Роман Зайруллин</p>
<p class="date">Created: 2016-06-08 Ср 13:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
